{
  "homepage": "https://minecraft.curseforge.com/projects/moar-boats",
  "1.12.2": {
    "3.0.0.0": "+ Boat Fluid Tank\n	+ Transport fluids inside your boat! (uses the Forge capability system to ensure compatibility)\n	* Only works inside of boats\n+ Boat Energy Battery\n	+ Transport energy inside your boat! (RF/Forge Energy)\n	* Only works inside of boats\n\n+ Boat Fluid Loader\n	+ Combine a Boat Fluid Tank with a Dispenser to fill boats with a fluid!\n+ Boat Fluid Unloader\n	+ Combine a Boat Fluid Tank with a Hopper to empty boats of their fluid!\n\n+ Boat Energy Charger\n	+ Combine a Boat Energy Battery with a Dispenser to fill boats with energy!\n+ Boat Fluid Unloader\n	+ Combine a Boat Energy Battery with a Hopper to empty boats of energy!\n\n* Dyeable boats!\n	* Combine a Modular Boat with 3 dye items of the same color to change the color of your boat!\n\n+ Waterborne comparator\n	+ Count the number of items inside a boat!\n\n* (Technical) Moar Boats now uses a ForgeRegistry to register modules"
    "2.1.0.2": "* Fixed game crashing when placing an icebreaker module",
    "2.1.0.0": "+ Animal Boats!\n	+ Craft it with gold instead of iron\n	+ Transport your animals around the world!\n+ Rudder module\n	+ (Finally) Control manually your boat! (requires an engine)\n+ Added button to remove a module from a modular boat\n* Fixed TNT not lit when placed by dispenser module\n* Dispenser/Dropper modules can be rotated\n* Nerfed fishing speed",
    "2.0.0": "+ New boat path editor (Includes Zooming&Scrolling !)\n	+ Accessible via a button on the Helm menu\n	+ Access a detailed view of the map (only for loaded chunks on the server)\n- Removed old path '''editor'''\n+ Added an option to make paths non-looping\n	+ Boats will stop at the last node of the path\n+ Blocked-by-module engines show the module responsible\n* (Fix) The Helm module no longer breaks map.\n* (Fix) Hoppers no longer remove fuel from the engine modules.\n* (Fix) Hoppers no longer remove rods from the fishing module.\n* (Fix) A boat blocked by a module or a redstone signal can be moved by pushing it or a fishing rod.\n* Switched to new versioning scheme",
    "1.3.2": "* Boats completly stop when touching a lit waterborne conductor\n* Update checker should work properly now",
    "1.3.1": "* Fixed icebreaker recipe",
    "1.3.0": "+ Dispenser module: place blocks and spawn items!\n+ Sonar module: make your boat follow streams!\n	+ Moar Boats does not give any guarantee that your boat won't get lost in oceans.\n+ Icebreaker module! Break the ice!\n+ Creative mode engine module (requires no fuel)\n+ Diving module: Breathe underwater next to the boat!\n* Reinforced the boat, it should be able to go on lava now.\n* Boat speed is now configurable in the engine GUI.\n* (Bug fix) Seats are no longer made out of dark oak boats",
    "1.2.1": "+ Added configuration file\n* Fishing rods are now damaged when used in the fishing module\n* Added configuration options for fishing speed and rod removal before breaking"
  },
  "promos": {
    "1.12.2-recommended": "3.0.0.0",
    "1.12.2-latest": "3.0.0.0"
  }
}
